src/cf/Documents/ПродажаЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ПродажаЦенныхБумаг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансоваяСтоимостьБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТорговаяПлощадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Брокеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ПродажаЦенныхБумаг/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервереБезКонтекста
Функция КратностьБумаги(Бумага)
    
    Возврат Бумага.Кратность;
    
КонецФункции

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Цена", Объект.Цена);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Сумма = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетСуммы");
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Цена", Объект.Цена);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Сумма = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетСуммы");
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);
    РеквизитыРасчета.Вставить("Количество", Объект.Количество);
    Объект.Цена = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетЦены");
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегулирование(Элемент, Направление, СтандартнаяОбработка)
    
    СтандартнаяОбработка = Ложь;
    Объект.Количество = Объект.Количество + КратностьБумаги(Объект.Бумага) * Направление;
    КоличествоПриИзменении(Неопределено);
    Модифицированность = Истина;
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура ТорговаяПлощадкаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура БрокерПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры

&НаКлиенте
Процедура БумагаПриИзменении(Элемент)
    
    РеквизитыРасчета = Новый Структура();
    РеквизитыРасчета.Вставить("ТорговаяПлощадка", Объект.ТорговаяПлощадка);
    РеквизитыРасчета.Вставить("Брокер", Объект.Брокер);
    РеквизитыРасчета.Вставить("ДатаСреза", Объект.Дата);
    РеквизитыРасчета.Вставить("Бумага", Объект.Бумага);
    РеквизитыРасчета.Вставить("Сумма", Объект.Сумма);  
    Объект.Комиссия = ЗаполнениеДокументовСервер.РасчетПоРеквизитам(РеквизитыРасчета, "РасчетКомиссии");
    
КонецПроцедуры
